; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-56)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 - object)
 (:init 
    (arm-empty)
    (clear b13)
    (on b13 b17)
    (on b17 b5)
    (on b5 b9)
    (on b9 b6)
    (on b6 b11)
    (on b11 b8)
    (on b8 b14)
    (on-table b14)
    (clear b10)
    (on-table b10)
    (clear b4)
    (on-table b4)
    (clear b12)
    (on b12 b1)
    (on b1 b7)
    (on b7 b3)
    (on b3 b2)
    (on b2 b15)
    (on b15 b16)
    (on-table b16))
 (:goal (and 
(on-table b14)
(on-table b12)
(on-table b11)
(clear b14)
(on b5 b12)
(on b16 b11)
(on b17 b5)
(on b2 b17)
(on b8 b16)
(on b9 b2)
(on b13 b8)
(clear b1) (on b1 b9)
(on b10 b13)
(on b6 b10)
(on b15 b6)
(on b4 b15)
(on b3 b4)
))
)

; plan
1. (unstack b12 b1)
   deleted: (on b12 b1) (clear b12) (arm-empty)
   added: (holding b12) (clear b1)
   goals met: 3 of 18
2. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 4 of 18
3. (unstack b13 b17)
   deleted: (on b13 b17) (clear b13) (arm-empty)
   added: (holding b13) (clear b17)
   goals met: 4 of 18
4. (stack b13 b10)
   deleted: (clear b10) (holding b13)
   added: (arm-empty) (clear b13) (on b13 b10)
   goals met: 4 of 18
5. (unstack b17 b5)
   deleted: (on b17 b5) (clear b17) (arm-empty)
   added: (holding b17) (clear b5)
   goals met: 3 of 18
6. (stack b17 b13)
   deleted: (clear b13) (holding b17)
   added: (arm-empty) (clear b17) (on b17 b13)
   goals met: 3 of 18
7. (unstack b5 b9)
   deleted: (on b5 b9) (clear b5) (arm-empty)
   added: (holding b5) (clear b9)
   goals met: 3 of 18
8. (stack b5 b12)
   deleted: (clear b12) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b12)
   goals met: 4 of 18
9. (unstack b17 b13)
   deleted: (on b17 b13) (clear b17) (arm-empty)
   added: (holding b17) (clear b13)
   goals met: 4 of 18
10. (stack b17 b5)
   deleted: (clear b5) (holding b17)
   added: (arm-empty) (clear b17) (on b17 b5)
   goals met: 5 of 18
11. (unstack b1 b7)
   deleted: (on b1 b7) (clear b1) (arm-empty)
   added: (holding b1) (clear b7)
   goals met: 4 of 18
12. (stack b1 b13)
   deleted: (clear b13) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b13)
   goals met: 5 of 18
13. (unstack b7 b3)
   deleted: (on b7 b3) (clear b7) (arm-empty)
   added: (holding b7) (clear b3)
   goals met: 5 of 18
14. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 5 of 18
15. (unstack b3 b2)
   deleted: (on b3 b2) (clear b3) (arm-empty)
   added: (holding b3) (clear b2)
   goals met: 5 of 18
16. (stack b3 b7)
   deleted: (clear b7) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b7)
   goals met: 5 of 18
17. (unstack b2 b15)
   deleted: (on b2 b15) (clear b2) (arm-empty)
   added: (holding b2) (clear b15)
   goals met: 5 of 18
18. (stack b2 b17)
   deleted: (clear b17) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b17)
   goals met: 6 of 18
19. (unstack b9 b6)
   deleted: (on b9 b6) (clear b9) (arm-empty)
   added: (holding b9) (clear b6)
   goals met: 6 of 18
20. (stack b9 b2)
   deleted: (clear b2) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b2)
   goals met: 7 of 18
21. (unstack b1 b13)
   deleted: (on b1 b13) (clear b1) (arm-empty)
   added: (holding b1) (clear b13)
   goals met: 6 of 18
22. (stack b1 b9)
   deleted: (clear b9) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b9)
   goals met: 8 of 18
23. (unstack b6 b11)
   deleted: (on b6 b11) (clear b6) (arm-empty)
   added: (holding b6) (clear b11)
   goals met: 8 of 18
24. (stack b6 b3)
   deleted: (clear b3) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b3)
   goals met: 8 of 18
25. (unstack b11 b8)
   deleted: (on b11 b8) (clear b11) (arm-empty)
   added: (holding b11) (clear b8)
   goals met: 8 of 18
26. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 9 of 18
27. (unstack b15 b16)
   deleted: (on b15 b16) (clear b15) (arm-empty)
   added: (holding b15) (clear b16)
   goals met: 9 of 18
28. (stack b15 b4)
   deleted: (clear b4) (holding b15)
   added: (arm-empty) (clear b15) (on b15 b4)
   goals met: 9 of 18
29. (pickup b16)
   deleted: (clear b16) (on-table b16) (arm-empty)
   added: (holding b16)
   goals met: 9 of 18
30. (stack b16 b11)
   deleted: (clear b11) (holding b16)
   added: (arm-empty) (clear b16) (on b16 b11)
   goals met: 10 of 18
31. (unstack b8 b14)
   deleted: (on b8 b14) (clear b8) (arm-empty)
   added: (holding b8) (clear b14)
   goals met: 11 of 18
32. (stack b8 b16)
   deleted: (clear b16) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b16)
   goals met: 12 of 18
33. (unstack b13 b10)
   deleted: (on b13 b10) (clear b13) (arm-empty)
   added: (holding b13) (clear b10)
   goals met: 12 of 18
34. (stack b13 b8)
   deleted: (clear b8) (holding b13)
   added: (arm-empty) (clear b13) (on b13 b8)
   goals met: 13 of 18
35. (pickup b10)
   deleted: (clear b10) (on-table b10) (arm-empty)
   added: (holding b10)
   goals met: 13 of 18
36. (stack b10 b13)
   deleted: (clear b13) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b13)
   goals met: 14 of 18
37. (unstack b6 b3)
   deleted: (on b6 b3) (clear b6) (arm-empty)
   added: (holding b6) (clear b3)
   goals met: 14 of 18
38. (stack b6 b10)
   deleted: (clear b10) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b10)
   goals met: 15 of 18
39. (unstack b15 b4)
   deleted: (on b15 b4) (clear b15) (arm-empty)
   added: (holding b15) (clear b4)
   goals met: 15 of 18
40. (stack b15 b6)
   deleted: (clear b6) (holding b15)
   added: (arm-empty) (clear b15) (on b15 b6)
   goals met: 16 of 18
41. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 16 of 18
42. (stack b4 b15)
   deleted: (clear b15) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b15)
   goals met: 17 of 18
43. (unstack b3 b7)
   deleted: (on b3 b7) (clear b3) (arm-empty)
   added: (holding b3) (clear b7)
   goals met: 17 of 18
44. (stack b3 b4)
   deleted: (clear b4) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b4)
   goals met: 18 of 18
